In [1]:
import numpy as np
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

In [2]:
data=pd.read_excel("Data_Train.xlsx")

In [4]:
#!pip install xlrd

In [3]:
data.head()

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
0,Maruti Wagon R LXI CNG,Mumbai,2010,72000,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,NaN,1.75
1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,Diesel,Manual,First,19.67 kmpl,1582 CC,126.2 bhp,5.0,NaN,12.50
2,Honda Jazz V,Chennai,2011,46000,Petrol,Manual,First,18.2 kmpl,1199 CC,88.7 bhp,5.0,8.61 Lakh,4.50
3,Maruti Ertiga VDI,Chennai,2012,87000,Diesel,Manual,First,20.77 kmpl,1248 CC,88.76 bhp,7.0,NaN,6.00
4,Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,Diesel,Automatic,Second,15.2 kmpl,1968 CC,140.8 bhp,5.0,NaN,17.74

In [280]:
#data[pd.isnull(data["Power"])]

In [5]:
data.shape

(6019, 13)

In [6]:
data.isnull().sum()

Name                    0
Location                0
Year                    0
Kilometers_Driven       0
Fuel_Type               0
Transmission            0
Owner_Type              0
Mileage                 2
Engine                 36
Power                  36
Seats                  42
New_Price            5195
Price                   0
dtype: int64

In [7]:
x=data["Name"][1].split(" ")[0:2]

In [8]:
def gett(x):
    return(x[0]+x[1])

In [9]:
gett(x)

'HyundaiCreta'

In [10]:
data["Name"]=data["Name"].apply(lambda x :x.split(" "))
data["Name"]=data["Name"].apply(lambda x : gett(x))

In [11]:
data["how_old"]=data["Year"].apply(lambda x: 2019-x)

In [12]:
data.drop(labels="New_Price",axis=1,inplace=True)

In [13]:
data[pd.isnull(data["Mileage"])]

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,Price,how_old
4446,MahindraE,Chennai,2016,50000,Electric,Automatic,First,NaN,72 CC,41 bhp,5.0,13.00,3
4904,ToyotaPrius,Mumbai,2011,44000,Electric,Automatic,First,NaN,1798 CC,73 bhp,5.0,12.75,8

In [14]:
data["Seats"].value_counts()

5.0     5014
7.0      674
8.0      134
4.0       99
6.0       31
2.0       16
10.0       5
9.0        3
0.0        1
Name: Seats, dtype: int64

In [15]:
#data[pd.isnull(data["Seats"])]

In [16]:
data.head()

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,Price,how_old
0,MarutiWagon,Mumbai,2010,72000,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,1.75,9
1,HyundaiCreta,Pune,2015,41000,Diesel,Manual,First,19.67 kmpl,1582 CC,126.2 bhp,5.0,12.50,4
2,HondaJazz,Chennai,2011,46000,Petrol,Manual,First,18.2 kmpl,1199 CC,88.7 bhp,5.0,4.50,8
3,MarutiErtiga,Chennai,2012,87000,Diesel,Manual,First,20.77 kmpl,1248 CC,88.76 bhp,7.0,6.00,7
4,AudiA4,Coimbatore,2013,40670,Diesel,Automatic,Second,15.2 kmpl,1968 CC,140.8 bhp,5.0,17.74,6

In [17]:
setnull=data[["Fuel_Type","Power","Transmission","Mileage","Engine","Seats","Price"]]

In [18]:
setnull.head()

  Fuel_Type      Power Transmission     Mileage   Engine  Seats  Price
0       CNG  58.16 bhp       Manual  26.6 km/kg   998 CC    5.0   1.75
1    Diesel  126.2 bhp       Manual  19.67 kmpl  1582 CC    5.0  12.50
2    Petrol   88.7 bhp       Manual   18.2 kmpl  1199 CC    5.0   4.50
3    Diesel  88.76 bhp       Manual  20.77 kmpl  1248 CC    7.0   6.00
4    Diesel  140.8 bhp    Automatic   15.2 kmpl  1968 CC    5.0  17.74

In [19]:
a="26.65h"
a[0:4]

'26.6'

In [20]:
setnull["Mileage"]=setnull["Mileage"].astype("str")

In [21]:
setnull["Mileage"]=setnull["Mileage"].apply(lambda x : x[0:4])

In [22]:
setnull["Engine"]=setnull["Engine"].astype("str")

In [23]:
setnull["Engine"]=setnull["Engine"].apply(lambda x : x.replace("CC",""))

In [24]:
setnull["Power"]=setnull["Power"].astype("str")

In [25]:
setnull["Power"]=setnull["Power"].apply(lambda x : x.replace("bhp",""))

In [26]:
setnull[75:79]

   Fuel_Type    Power Transmission Mileage Engine  Seats  Price
75    Diesel  187.74     Automatic    18.5  1968     5.0  29.50
76    Diesel    null        Manual    17.8  1399     5.0   2.00
77    Petrol     132        Manual    12.4  1998     8.0   4.50
78    Diesel     102        Manual    12.8  2494     7.0  11.75

In [27]:
setnull["Power"]=setnull["Power"].replace("null ",np.NaN)

In [28]:
from sklearn.preprocessing import LabelEncoder

In [29]:
le1=LabelEncoder()
le2=LabelEncoder()

In [30]:
setnull["Fuel_Type"]=le1.fit_transform(setnull["Fuel_Type"])
setnull["Transmission"]=le2.fit_transform(setnull["Transmission"])

In [31]:
#!pip install fancyimpute
setnull["Mileage"]=setnull["Mileage"].astype("float")
setnull["Engine"]=setnull["Engine"].astype("float")
setnull["Power"]=setnull["Power"].astype("float")

In [32]:
from fancyimpute import KNN
X_filles= KNN(k=7).fit_transform(setnull)

Using TensorFlow backend.

Imputing row 1/6019 with 0 missing, elapsed time: 6.332
Imputing row 101/6019 with 0 missing, elapsed time: 6.332
Imputing row 201/6019 with 0 missing, elapsed time: 6.332
Imputing row 301/6019 with 0 missing, elapsed time: 6.332
Imputing row 401/6019 with 0 missing, elapsed time: 6.337
Imputing row 501/6019 with 0 missing, elapsed time: 6.337
Imputing row 601/6019 with 0 missing, elapsed time: 6.337
Imputing row 701/6019 with 0 missing, elapsed time: 6.337
Imputing row 801/6019 with 0 missing, elapsed time: 6.337
Imputing row 901/6019 with 0 missing, elapsed time: 6.337
Imputing row 1001/6019 with 0 missing, elapsed time: 6.342
Imputing row 1101/6019 with 0 missing, elapsed time: 6.342
Imputing row 1201/6019 with 0 missing, elapsed time: 6.342
Imputing row 1301/6019 with 0 missing, elapsed time: 6.342
Imputing row 1401/6019 with 0 missing, elapsed time: 6.342
Imputing row 1501/6019 with 0 missing, elapsed time: 6.342
Imputing row 1601/6019 with 0 missing, elapsed time: 6.342
Imputing row 1701/6019 with 0 missing, elapsed time: 6.347
Imputing row 1801/6019 with 0 missing, elapsed time: 6.347
Imputing row 1901/6019 with 0 missing, elapsed time: 6.347
Imputing row 2001/6019 with 0 missing, elapsed time: 6.347
Imputing row 2101/6019 with 0 missing, elapsed time: 6.347
Imputing row 2201/6019 with 0 missing, elapsed time: 6.347
Imputing row 2301/6019 with 0 missing, elapsed time: 6.347
Imputing row 2401/6019 with 0 missing, elapsed time: 6.352
Imputing row 2501/6019 with 0 missing, elapsed time: 6.352
Imputing row 2601/6019 with 0 missing, elapsed time: 6.352
Imputing row 2701/6019 with 0 missing, elapsed time: 6.352
Imputing row 2801/6019 with 0 missing, elapsed time: 6.352
Imputing row 2901/6019 with 0 missing, elapsed time: 6.352
Imputing row 3001/6019 with 0 missing, elapsed time: 6.357
Imputing row 3101/6019 with 0 missing, elapsed time: 6.357
Imputing row 3201/6019 with 0 missing, elapsed time: 6.357
Imputing row 3301/6019 with 0 missing, elapsed time: 6.357
Imputing row 3401/6019 with 0 missing, elapsed time: 6.357
Imputing row 3501/6019 with 0 missing, elapsed time: 6.362
Imputing row 3601/6019 with 0 missing, elapsed time: 6.362
Imputing row 3701/6019 with 0 missing, elapsed time: 6.362
Imputing row 3801/6019 with 2 missing, elapsed time: 6.362
Imputing row 3901/6019 with 0 missing, elapsed time: 6.362
Imputing row 4001/6019 with 0 missing, elapsed time: 6.362
Imputing row 4101/6019 with 0 missing, elapsed time: 6.362
Imputing row 4201/6019 with 0 missing, elapsed time: 6.367
Imputing row 4301/6019 with 0 missing, elapsed time: 6.367
Imputing row 4401/6019 with 0 missing, elapsed time: 6.367
Imputing row 4501/6019 with 0 missing, elapsed time: 6.367
Imputing row 4601/6019 with 0 missing, elapsed time: 6.367
Imputing row 4701/6019 with 0 missing, elapsed time: 6.372
Imputing row 4801/6019 with 0 missing, elapsed time: 6.372
Imputing row 4901/6019 with 1 missing, elapsed time: 6.372
Imputing row 5001/6019 with 0 missing, elapsed time: 6.372
Imputing row 5101/6019 with 0 missing, elapsed time: 6.372
Imputing row 5201/6019 with 0 missing, elapsed time: 6.377
Imputing row 5301/6019 with 0 missing, elapsed time: 6.377
Imputing row 5401/6019 with 0 missing, elapsed time: 6.377
Imputing row 5501/6019 with 0 missing, elapsed time: 6.377
Imputing row 5601/6019 with 0 missing, elapsed time: 6.377
Imputing row 5701/6019 with 0 missing, elapsed time: 6.377
Imputing row 5801/6019 with 0 missing, elapsed time: 6.377
Imputing row 5901/6019 with 0 missing, elapsed time: 6.377
Imputing row 6001/6019 with 0 missing, elapsed time: 6.382

In [33]:
sett=pd.DataFrame(X_filles)

In [34]:
sett.columns=setnull.columns

In [35]:
sett.isnull().sum()

Fuel_Type       0
Power           0
Transmission    0
Mileage         0
Engine          0
Seats           0
Price           0
dtype: int64

In [36]:
data.shape

(6019, 13)

In [37]:
data.head()

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,Price,how_old
0,MarutiWagon,Mumbai,2010,72000,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,1.75,9
1,HyundaiCreta,Pune,2015,41000,Diesel,Manual,First,19.67 kmpl,1582 CC,126.2 bhp,5.0,12.50,4
2,HondaJazz,Chennai,2011,46000,Petrol,Manual,First,18.2 kmpl,1199 CC,88.7 bhp,5.0,4.50,8
3,MarutiErtiga,Chennai,2012,87000,Diesel,Manual,First,20.77 kmpl,1248 CC,88.76 bhp,7.0,6.00,7
4,AudiA4,Coimbatore,2013,40670,Diesel,Automatic,Second,15.2 kmpl,1968 CC,140.8 bhp,5.0,17.74,6

In [38]:
df1=pd.concat([data.drop(["Fuel_Type","Power","Seats","Transmission","Mileage","Engine","Price"],1),sett],axis=1)

In [39]:
df1.head()

,Name,Location,Year,Kilometers_Driven,Owner_Type,how_old,Fuel_Type,Power,Transmission,Mileage,Engine,Seats,Price
0,MarutiWagon,Mumbai,2010,72000,First,9,0.0,58.16,1.0,26.6,998.0,5.0,1.75
1,HyundaiCreta,Pune,2015,41000,First,4,1.0,126.20,1.0,19.6,1582.0,5.0,12.50
2,HondaJazz,Chennai,2011,46000,First,8,4.0,88.70,1.0,18.2,1199.0,5.0,4.50
3,MarutiErtiga,Chennai,2012,87000,First,7,1.0,88.76,1.0,20.7,1248.0,7.0,6.00
4,AudiA4,Coimbatore,2013,40670,Second,6,1.0,140.80,0.0,15.2,1968.0,5.0,17.74

In [40]:
df1["Fuel_Type"]=df1["Fuel_Type"].astype("int")

In [41]:
df1["Fuel_Type"]=le1.inverse_transform(df1["Fuel_Type"])

In [42]:
df1["Transmission"]=df1["Transmission"].astype("int")

In [43]:
df1["Transmission"]=le2.inverse_transform(df1["Transmission"])

In [44]:
df1.isnull().sum()

Name                 0
Location             0
Year                 0
Kilometers_Driven    0
Owner_Type           0
how_old              0
Fuel_Type            0
Power                0
Transmission         0
Mileage              0
Engine               0
Seats                0
Price                0
dtype: int64

In [45]:
df1.head()

,Name,Location,Year,Kilometers_Driven,Owner_Type,how_old,Fuel_Type,Power,Transmission,Mileage,Engine,Seats,Price
0,MarutiWagon,Mumbai,2010,72000,First,9,CNG,58.16,Manual,26.6,998.0,5.0,1.75
1,HyundaiCreta,Pune,2015,41000,First,4,Diesel,126.20,Manual,19.6,1582.0,5.0,12.50
2,HondaJazz,Chennai,2011,46000,First,8,Petrol,88.70,Manual,18.2,1199.0,5.0,4.50
3,MarutiErtiga,Chennai,2012,87000,First,7,Diesel,88.76,Manual,20.7,1248.0,7.0,6.00
4,AudiA4,Coimbatore,2013,40670,Second,6,Diesel,140.80,Automatic,15.2,1968.0,5.0,17.74

In [47]:
df1["Name"].value_counts().head()

MarutiSwift     353
HondaCity       270
Hyundaii20      247
HyundaiVerna    170
ToyotaInnova    164
Name: Name, dtype: int64

In [52]:
Namee=pd.get_dummies(df1["Name"],prefix="Name")
owner_type=pd.get_dummies(df1["Owner_Type"],prefix="Owner")
how_old=pd.get_dummies(df1["how_old"],prefix="old")
fuel_type=pd.get_dummies(df1["Fuel_Type"],prefix="fuel")
transm=pd.get_dummies(df1["Transmission"],prefix="Trans")

In [56]:
Namee.shape , df1.shape

((6019, 216), (6019, 13))

In [58]:
df1=pd.concat([Namee,owner_type,how_old,fuel_type,transm,df1],axis=1)

In [59]:
df1.drop(["Name","Owner_Type","how_old","Fuel_Type","Transmission"],axis=1,inplace=True)

In [61]:
df1.drop(["Location","Year"],axis=1,inplace=True)

In [62]:
df1.head()

,Name_AmbassadorClassic,Name_AudiA3,Name_AudiA4,Name_AudiA6,Name_AudiA7,Name_AudiA8,Name_AudiQ3,Name_AudiQ5,Name_AudiQ7,Name_AudiRS5,...,fuel_LPG,fuel_Petrol,Trans_Automatic,Trans_Manual,Kilometers_Driven,Power,Mileage,Engine,Seats,Price
0,0,0,0,0,0,0,0,0,0,0,...,0,0,0,1,72000,58.16,26.6,998.0,5.0,1.75
1,0,0,0,0,0,0,0,0,0,0,...,0,0,0,1,41000,126.20,19.6,1582.0,5.0,12.50
2,0,0,0,0,0,0,0,0,0,0,...,0,1,0,1,46000,88.70,18.2,1199.0,5.0,4.50
3,0,0,0,0,0,0,0,0,0,0,...,0,0,0,1,87000,88.76,20.7,1248.0,7.0,6.00
4,0,0,1,0,0,0,0,0,0,0,...,0,0,1,0,40670,140.80,15.2,1968.0,5.0,17.74

In [63]:
from scipy.stats import zscore

In [64]:
X=df1.drop(labels="Price",axis=1).apply(zscore)

In [66]:
y=df1["Price"]

In [67]:
from sklearn.model_selection import train_test_split

In [69]:
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.3,random_state=1)

In [73]:
from sklearn.datasets import load_boston
from sklearn.linear_model import LinearRegression
from sklearn.linear_model import Ridge

In [74]:
lr = LinearRegression()
lr.fit(X_train, y_train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [75]:
lr.score(X_test,y_test)

-1.582074088759261e+26

In [76]:
rr = Ridge(alpha=0.01) # higher the alpha value, more restriction on the coefficients; low alpha > more generalization, coefficients are barely
# restricted and in this case linear and ridge regression resembles
rr.fit(X_train, y_train)

Ridge(alpha=0.01, copy_X=True, fit_intercept=True, max_iter=None,
      normalize=False, random_state=None, solver='auto', tol=0.001)

In [77]:
rr.score(X_test,y_test)

0.7781776694423969